{
  "simonwillison.net": [
    {
      "title": "Quoting ROUGH DRAFT 8/2/66",
      "url": "https://simonwillison.net/2026/Feb/17/rough-draft-8266/#atom-everything",
      "source": "simonwillison.net",
      "published": "2026-02-17T14:49:04+00:00",
      "summary": "This is the story of the United Space Ship Enterprise. Assigned a five year patrol of our galaxy, the giant starship visits Earth colonies, regulates commerce, and explores strange new worlds and civilizations. These are its voyages... and its adventures. — ROUGH DRAFT 8/2/66 , before the Star Trek opening narration reached its final form Tags: screen-writing , science-fiction",
      "full_content": null
    },
    {
      "title": "First kākāpō chick in four years hatches on Valentine's Day",
      "url": "https://simonwillison.net/2026/Feb/17/first-kakapo-chick-in-four-years/#atom-everything",
      "source": "simonwillison.net",
      "published": "2026-02-17T14:09:43+00:00",
      "summary": "First kākāpō chick in four years hatches on Valentine's Day First chick of the 2026 breeding season ! Kākāpō Yasmine hatched an egg fostered from kākāpō Tīwhiri on Valentine's Day, bringing the total number of kākāpō to 237 – though it won’t be officially added to the population until it fledges. Here's why the egg was fostered: \"Kākāpō mums typically have the best outcomes when raising a maximum of two chicks. Biological mum Tīwhiri has four fertile eggs this season already, while Yasmine, an experienced foster mum, had no fertile eggs.\" And an update from conservation biologist Andrew Digby - a second chick hatched this morning! The second #kakapo chick of the #kakapo2026 breeding season hatched this morning: Hine Taumai-A1-2026 on Ako's nest on Te Kākahu. We transferred the egg from Anchor two nights ago. This is Ako's first-ever chick, which is just a few hours old in this video. That post has a video of mother and chick. Via MetaFilter Tags: kakapo",
      "full_content": null
    },
    {
      "title": "Quoting Dimitris Papailiopoulos",
      "url": "https://simonwillison.net/2026/Feb/17/dimitris-papailiopoulos/#atom-everything",
      "source": "simonwillison.net",
      "published": "2026-02-17T14:04:44+00:00",
      "summary": "But the intellectually interesting part for me is something else. I now have something close to a magic box where I throw in a question and a first answer comes back basically for free, in terms of human effort . Before this, the way I'd explore a new idea is to either clumsily put something together myself or ask a student to run something short for signal, and if it's there, we’d go deeper. That quick signal step, i.e., finding out if a question has any meat to it, is what I can now do without taking up anyone else's time. It’s now between just me, Claude Code, and a few days of GPU time. I don’t know what this means for how we do research long term. I don’t think anyone does yet. But the distance between a question and a first answer just got very small . — Dimitris Papailiopoulos , on running research questions though Claude Code Tags: research , coding-agents , claude-code , generative-ai , ai , llms",
      "full_content": null
    },
    {
      "title": "Nano Banana Pro diff to webcomic",
      "url": "https://simonwillison.net/2026/Feb/17/release-notes-webcomic/#atom-everything",
      "source": "simonwillison.net",
      "published": "2026-02-17T04:51:58+00:00",
      "summary": "Given the threat of cognitive debt brought on by AI-accelerated software development leading to more projects and less deep understanding of how they work and what they actually do, it's interesting to consider artifacts that might be able to help. Nathan Baschez on Twitter : my current favorite trick for reducing \"cognitive debt\" (h/t @simonw\n) is to ask the LLM to write two versions of the plan: The version for it (highly technical and detailed) The version for me (an entertaining essay designed to build my intuition) Works great This inspired me to try something new. I generated the diff between v0.5.0 and v0.6.0 of my Showboat project - which introduced the remote publishing feature - and dumped that into Nano Banana Pro with the prompt: Create a webcomic that explains the new feature as clearly and entertainingly as possible Here's what it produced : Good enough to publish with the release notes? I don't think so. I'm sharing it here purely to demonstrate the idea. Creating assets like this as a personal tool for thinking about novel ways to explain a feature feels worth exploring further. Tags: nano-banana , gemini , llms , cognitive-debt , generative-ai , ai , text-to-image , showboat , ai-assisted-programming",
      "full_content": null
    },
    {
      "title": "Qwen3.5: Towards Native Multimodal Agents",
      "url": "https://simonwillison.net/2026/Feb/17/qwen35/#atom-everything",
      "source": "simonwillison.net",
      "published": "2026-02-17T04:30:57+00:00",
      "summary": "Qwen3.5: Towards Native Multimodal Agents Alibaba's Qwen just released the first two models in the Qwen 3.5 series - one open weights, one proprietary. Both are multi-modal for vision input. The open weight one is a Mixture of Experts model called Qwen3.5-397B-A17B. Interesting to see Qwen call out serving efficiency as a benefit of that architecture: Built on an innovative hybrid architecture that fuses linear attention (via Gated Delta Networks) with a sparse mixture-of-experts, the model attains remarkable inference efficiency: although it comprises 397 billion total parameters, just 17 billion are activated per forward pass, optimizing both speed and cost without sacrificing capability. It's 807GB on Hugging Face , and Unsloth have a collection of smaller GGUFs ranging in size from 94.2GB 1-bit to 462GB Q8_K_XL. I got this pelican from the OpenRouter hosted model ( transcript ): The proprietary hosted model is called Qwen3.5 Plus 2026-02-15, and is a little confusing. Qwen researcher Junyang Lin  says : Qwen3-Plus is a hosted API version of 397B. As the model natively supports 256K tokens, Qwen3.5-Plus supports 1M token context length. Additionally it supports search and code interpreter, which you can use on Qwen Chat with Auto mode. Here's its pelican , which is similar in quality to the open weights model: Tags: ai , generative-ai , llms , vision-llms , qwen , pelican-riding-a-bicycle , llm-release , openrouter , ai-in-china",
      "full_content": null
    },
    {
      "title": "Two new Showboat tools: Chartroom and datasette-showboat",
      "url": "https://simonwillison.net/2026/Feb/17/chartroom-and-datasette-showboat/#atom-everything",
      "source": "simonwillison.net",
      "published": "2026-02-17T00:43:45+00:00",
      "summary": "I introduced Showboat a week ago - my CLI tool that helps coding agents create Markdown documents that demonstrate the code that they have created. I've been finding new ways to use it on a daily basis, and I've just released two new tools to help get the best out of the Showboat pattern. Chartroom is a CLI charting tool that works well with Showboat, and datasette-showboat lets Showboat's new remote publishing feature incrementally push documents to a Datasette instance. Showboat remote publishing datasette-showboat Chartroom How I built Chartroom The burgeoning Showboat ecosystem Showboat remote publishing I normally use Showboat in Claude Code for web (see note from this morning ). I've used it in several different projects in the past few days, each of them with a prompt that looks something like this: Use \"uvx showboat --help\" to perform a very thorough investigation of what happens if you use the Python sqlite-chronicle and sqlite-history-json libraries against the same SQLite database table Here's the resulting document . Just telling Claude Code to run uvx showboat --help is enough for it to learn how to use the tool - the help text is designed to work as a sort of ad-hoc Skill document. The one catch with this approach is that I can't see the new Showboat document until it's finished. I have to wait for Claude to commit the document plus embedded screenshots and push that to a branch in my GitHub repo - then I can view it through the GitHub interface. For a while I've been thinking it would be neat to have a remote web server of my own which Claude instances can submit updates to while they are working. Then this morning I realized Showboat might be the ideal mechanism to set that up... Showboat v0.6.0 adds a new \"remote\" feature. It's almost invisible to users of the tool itself, instead being configured by an environment variable. Set a variable like this: export SHOWBOAT_REMOTE_URL=https://www.example.com/submit ? token=xyz And every time you run a showboat init or showboat note or showboat exec or showboat image command the resulting document fragments will be POSTed to that API endpoint, in addition to the Showboat Markdown file itself being updated. There are full details in the Showboat README - it's a very simple API format, using regular POST form variables or a multipart form upload for the image attached to showboat image . datasette-showboat It's simple enough to build a webapp to receive these updates from Showboat, but I needed one that I could easily deploy and would work well with the rest of my personal ecosystem. So I had Claude Code write me a Datasette plugin that could act as a Showboat remote endpoint. I actually had this building at the same time as the Showboat remote feature, a neat example of running parallel agents . datasette-showboat is a Datasette plugin that adds a /-/showboat endpoint to Datasette for viewing documents and a /-/showboat/receive endpoint for receiving updates from Showboat. Here's a very quick way to try it out: uvx --with datasette-showboat --prerelease=allow \\\n  datasette showboat.db --create \\\n  -s plugins.datasette-showboat.database showboat \\\n  -s plugins.datasette-showboat.token secret123 \\\n  --root --secret cookie-secret-123 Click on the sign in as root link that shows up in the console, then navigate to http://127.0.0.1:8001/-/showboat to see the interface. Now set your environment variable to point to this instance: export SHOWBOAT_REMOTE_URL= \" http://127.0.0.1:8001/-/showboat/receive?token=secret123 \" And run Showboat like this: uvx showboat init demo.md \" Showboat Feature Demo \" Refresh that page and you should see this: Click through to the document, then start Claude Code or Codex or your agent of choice and prompt: Run 'uvx showboat --help' and then use showboat to add to the existing demo.md document with notes and exec and image to demonstrate the tool - fetch a placekitten for the image demo. The init command assigns a UUID and title and sends those up to Datasette. The best part of this is that it works in Claude Code for web. Run the plugin on a server somewhere (an exercise left up to the reader - I use Fly.io to host mine) and set that SHOWBOAT_REMOTE_URL environment variable in your Claude environment, then any time you tell it to use Showboat the document it creates will be transmitted to your server and viewable in real time. I built Rodney , a CLI browser automation tool, specifically to work with Showboat. It makes it easy to have a Showboat document load up web pages, interact with them via clicks or injected JavaScript and captures screenshots to embed in the Showboat document and show the effects. This is wildly useful for hacking on web interfaces using Claude Code for web, especially when coupled with the new remote publishing feature. I only got this stuff working this morning and I've already had several sessions where Claude Code has published screenshots of its work in progress, which I've then been able to provide feedback on directly in the Claude session while it's still working. Chartroom A few days ago I had another idea for a way to extend the Showboat ecosystem: what if Showboat documents could easily include charts? I sometimes fire up Claude Code for data analysis tasks, often telling it to download a SQLite database and then run queries against it to figure out interesting things from the data. With a simple CLI tool that produced PNG images I could have Claude use Showboat to build a document with embedded charts to help illustrate its findings. Chartroom is exactly that. It's effectively a thin wrapper around the excellent matplotlib Python library, designed to be used by coding agents to create charts that can be embedded in Showboat documents. Here's how to render a simple bar chart: echo ' name,value Alice,42 Bob,28 Charlie,35 Diana,51 Eve,19 ' | uvx chartroom bar --csv \\\n  --title ' Sales by Person ' --ylabel ' Sales ' It can also do line charts, bar charts, scatter charts, and histograms - as seen in this demo document that was built using Showboat. Chartroom can also generate alt text. If you add -f alt to the above it will output the alt text for the chart instead of the image: echo ' name,value Alice,42 Bob,28 Charlie,35 Diana,51 Eve,19 ' | uvx chartroom bar --csv \\\n  --title ' Sales by Person ' --ylabel ' Sales ' -f alt Outputs: Sales by Person. Bar chart of value by name — Alice: 42, Bob: 28, Charlie: 35, Diana: 51, Eve: 19 Or you can use -f html or -f markdown to get the image tag with alt text directly: ![ Sales by Person. Bar chart of value by name — Alice: 42, Bob: 28, Charlie: 35, Diana: 51, Eve: 19 ] ( /Users/simon/chart-7.png ) I added support for Markdown images with alt text to Showboat in v0.5.0 , to complement this feature of Chartroom. Finally, Chartroom has support for different matplotlib styles . I had Claude build a Showboat document to demonstrate these all in one place - you can see that at demo/styles.md . How I built Chartroom I started the Chartroom repository with my click-app cookiecutter template, then told a fresh Claude Code for web session: We are building a Python CLI tool which uses matplotlib to generate a PNG image containing a chart. It will have multiple sub commands for different chart types, controlled by command line options. Everything you need to know to use it will be available in the single \"chartroom --help\" output. It will accept data from files or standard input as CSV or TSV or JSON, similar to how sqlite-utils accepts data - clone simonw/sqlite-utils to /tmp for reference there. Clone matplotlib/matplotlib for reference as well It will also accept data from --sql path/to/sqlite.db \"select ...\" which runs in read-only mode Start by asking clarifying questions - do not use the ask user tool though it is broken - and generate a spec for me to approve Once approved proceed using red/green TDD running tests with \"uv run pytest\" Also while building maintain a demo/README.md document using the \"uvx showboat --help\" tool - each time you get a new chart type working commit the tests, implementation, root level\nREADME update and a new version of that demo/README.md document with an inline image demo of the new chart type (which should be a UUID image filename managed by the showboat image command and should be stored in the demo/ folder Make sure \"uv build\" runs cleanly without complaining about extra directories but also ensure dist/ and uv.lock are in gitignore This got most of the work done. You can see the rest in the PRs that followed. The burgeoning Showboat ecosystem The Showboat family of tools now consists of Showboat itself, Rodney for browser automation, Chartroom for charting and datasette-showboat for streaming remote Showboat documents to Datasette. I'm enjoying how these tools can operate together based on a very loose set of conventions. If a tool can output a path to an image Showboat can include that image in a document. Any tool that can output text can be used with Showboat. I'll almost certainly be building more tools that fit this pattern. They're very quick to knock out! The environment variable mechanism for Showboat's remote streaming is a fun hack too - so far I'm just using it to stream documents somewhere else, but it's effectively a webhook extension mechanism that could likely be used for all sorts of things I haven't thought of yet. Tags: charting , projects , ai , datasette , generative-ai , llms , ai-assisted-programming , coding-agents , claude-code , showboat",
      "full_content": null
    }
  ],
  "seangoedecke.com": [
    {
      "title": "LLM-generated skills work, if you generate them afterwards",
      "url": "https://seangoedecke.com/generate-skills-afterwards/",
      "source": "seangoedecke.com",
      "published": "2026-02-17T00:00:00+00:00",
      "summary": "LLM ‚Äúskills‚Äù are a short explanatory prompt for a particular task, typically bundled with helper scripts. A recent paper showed that while skills are useful to LLMs, LLM-authored skills are not. From the abstract: Self-generated skills provide no benefit on average, showing that models cannot reliably author the procedural knowledge they benefit from consuming For the moment, I don‚Äôt really want to dive into the paper. I just want to note that the way the paper uses LLMs to generate skills is bad, and you shouldn‚Äôt do this. Here‚Äôs how the paper prompts a LLM to produce skills: Before attempting to solve this task, please follow these steps: 1. Analyze the task requirements and identify what domain knowledge, APIs, or techniques are needed. 2. Write 1‚Äì5 modular skill documents that would help solve this task. Each skill should: focus on a specific tool, library, API, or technique; include installation/setup instructions if applicable; provide code examples and usage patterns; be reusable for similar tasks. 3. Save each skill as a markdown file in the environment/skills/ directory with a descriptive name. 4. Then solve the task using the skills you created as reference The key idea here is that they‚Äôre asking the LLM to produce a skill before it starts on the task. It‚Äôs essentially a strange version of the ‚Äúmake a plan first‚Äù or ‚Äúthink step by step‚Äù prompting strategy. I‚Äôm not at all surprised that this doesn‚Äôt help, because current reasoning models already think carefully about the task before they begin. What should you do instead? You should ask the LLM to write up a skill after it‚Äôs completed the task . Obviously this isn‚Äôt useful for truly one-off tasks. But few tasks are truly one-off. For instance, I‚Äôve recently been playing around with SAEs and trying to clamp features in open-source models, a la Golden Gate Claude . It took a while for Codex to get this right. Here are some things it had to figure out: Extracting features from the final layernorm is too late - you may as well just boost individual logits during sampling You have to extract from about halfway through the model layers to get features that can be usefully clamped Training a SAE on ~10k activations is two OOMs too few to get useful features. You need to train until features account for >50% of variance Once I was able (with Codex‚Äôs help) to clamp an 8B model and force it to obsess about a subject 1 , I then asked Codex to summarize the process into an agent skill 2 . That worked great! I was able to spin up a brand-new Codex instance with that skill and immediately get clamping working on a different 8B model. But if I‚Äôd asked Codex to write the skill at the start, it would have baked in all of its incorrect assumptions (like extracting from the final layernorm), and the skill wouldn‚Äôt have helped at all. In other words, the purpose of LLM-generated skills is to get it to distil the knowledge it‚Äôs gained by iterating on the problem for millions of tokens, not to distil the knowledge it already has from its training data. You can get a LLM to generate skills for you, so long as you do it after the LLM has already solved the problem the hard way . If you‚Äôre interested, it was ‚Äúgoing to the movies‚Äù. ‚Ü© I‚Äôve pushed it up here . I‚Äôm sure you could do much better for a feature-extraction skill, this was just my zero-effort Codex-only attempt. ‚Ü©",
      "full_content": null
    }
  ],
  "daringfireball.net": [
    {
      "title": "★ Apple Releases iOS 26 Adoption Rates, and They’re Pretty Much in Line With the Last Few Years",
      "url": "https://daringfireball.net/2026/02/apple_releases_ios_26_adoption_rates",
      "source": "daringfireball.net",
      "published": "2026-02-17T18:49:55+00:00",
      "summary": "At least according to Apple’s own numbers from the App Store, iOS 26 adoption is pretty much exactly in line with the rates for iOS 18 and 17.",
      "full_content": null
    },
    {
      "title": "How to Force Restart an iPhone",
      "url": "https://support.apple.com/guide/iphone/force-restart-iphone-iph8903c3ee6/ios",
      "source": "daringfireball.net",
      "published": "2026-02-17T17:20:01+00:00",
      "summary": "Apple Support: If iPhone isn’t responding, and you can’t turn it off then\non , try forcing it to restart. Press and quickly release the volume up button. Press and quickly release the volume down button. Press and hold the side button. When the Apple logo appears, release the side button. I upgraded my iPhone 17 Pro to iOS 26.3 this morning (straight from the release version of iOS 26.2 — I skipped the 26.3 betas), and by noon, it was stuck at the lock screen. Pressing and holding the side button and either of the volume buttons at the same time did not bring up the expected screen with “Slide to power off”, “Medical ID”, and “Emergency Call”. The above force-restart method worked, though. I knew it existed but I’d forgotten how to do it. Luckily, I was sitting right at my Mac, so I had another machine to use to look it up. I’d have been in a jam, though, if I’d been somewhere with only my (stuck) iPhone, so I think this one is worth memorizing. Step 3, the “press and hold the side button” step, takes quite a few seconds before the screen turns off. So I’m memorizing the process as three steps: Click the volume up button. Click the volume down button. Press and hold the side button, patiently, until the Apple logo appears. ★",
      "full_content": null
    },
    {
      "title": "[Sponsor] Hands-On Workshop: Fix It Faster — Crash Reporting, Tracing, and Logs for iOS in Sentry",
      "url": "https://sentry.io/resources/ios-workshop-jan-2026/?utm_source=daringfireball&utm_medium=paid-display&utm_campaign=general-fy27q1-evergreen&utm_content=static-ad-mobilerss-trysentry",
      "source": "daringfireball.net",
      "published": "2026-02-17T00:01:00+00:00",
      "summary": "Learn how to connect the dots between slowdowns, crashes, and the user experience in your iOS app. This on-demand session covers how to: Set up Sentry to surface high-priority mobile issues without alert fatigue. Use Logs and Breadcrumbs to reconstruct what happened with a crash. Find what’s behind a performance bottleneck using Tracing. Monitor and reduce the size of your iOS app using Size Analysis. Watch it here . ★",
      "full_content": null
    }
  ],
  "pluralistic.net": [
    {
      "title": "Pluralistic: What's a \"gig work minimum wage\" (17 Feb 2026)",
      "url": "https://pluralistic.net/2026/02/17/no-piecework/",
      "source": "pluralistic.net",
      "published": "2026-02-17T10:56:49+00:00",
      "summary": "Today's links What's a \"gig work minimum wage\": The important rate is what you're paid when you're waiting for a job. Hey look at this: Delights to delectate. Object permanence: MBA phrenology; Sony's DRM CEO is out; Midwestern Tahrir; Reverse Centaurs and AI. Upcoming appearances: Where to find me. Recent appearances: Where I've been. Latest books: You keep readin' em, I'll keep writin' 'em. Upcoming books: Like I said, I'll keep writin' 'em. Colophon: All the rest. What's a \"gig work minimum wage\" (permalink) \"Minimum wage\" is one of those odd concepts that seems to have an intuitive definition, but the harder you think about it, the more complicated it gets. For example, if you want to work, but can't find a job, then the minimum wage you'll get is zero: https://web.archive.org/web/20200625043843/https://www.latimes.com/entertainment-arts/books/story/2020-06-24/forget-ubi-says-an-economist-its-time-for-universal-basic-jobs That's why politicians like Avi Lewis (who is running for leader of Canada's New Democratic Party) has call for a jobs guarantee: a government guarantee of a good job at a socially inclusive wage for everyone who wants one: https://lewisforleader.ca/ideas/dignified-work-full-plan (Disclosure: I have advised the Lewis campaign on technical issues and I have endorsed his candidacy.) If that sounds Utopian or Communist to you (or both), consider this: it was the American jobs guarantee that delivered the America's system of national parks, among many other achievements: https://en.wikipedia.org/wiki/Civilian_Conservation_Corps The idea of a wage for everyone who wants a job is just one interesting question raised by the concept of a \"minimum wage.\" Even when we're talking about people who have wages, the idea of a \"minimum wage\" is anything but straightforward. Take gig workers: the rise of Uber and its successors created an ever-expanding class of workers who are misclassified as independent contractors by employers, seeking to evade unionization, benefits and liability. It's a weird kind of \"independent contractor\" who gets punished for saying no to lowball offers, has to decorate their personal clothes and/or cars in their \"client's\" livery, and who has every movement scripted by an app controlled by their \"client\": https://pluralistic.net/2024/02/02/upward-redistribution/ The pretext that a worker is actually a standalone small business confers another great advantage on their employers: it's a great boon to any boss who wants to steal their worker's wages. I'm not talking about stealing tips here (though gig-work platforms do steal tips, like crazy): https://www.nyc.gov/mayors-office/news/2026/01/mayor-mamdani-announces–5-million-settlement–reinstatement-of- I'm talking about how gig-work platforms define their workers' wages in the first place. This is a very salient definition in public policy debates. Gig platforms facing regulation or investigation routinely claim that their workers are paid sky-high wages. During the debate over California's Prop 22 (in which Uber and Lyft spent more than $225m to formalize worker misclassification), gig companies agreed to all kinds of reasonable-sounding wage guarantees: https://pluralistic.net/2020/10/14/final_ver2/#prop-22 When Toronto was grappling with the brutal effect that gig-work taxis have on the city's world-beatingly bad traffic, Uber promised to pay its drivers \"120% of the minimum wage,\" which would come out to $21.12 per hour. However, the real wage Uber was proposing to pay its drivers came out to about $2.50 per hour: https://pluralistic.net/2024/02/29/geometry-hates-uber/#toronto-the-gullible How to explain the difference? Well, Uber – and its gig-work competitors – only pay drivers while they have a passenger – or an item – in the car. Drivers are not paid for the time they spend waiting for a job or the time they spend getting to the job. This is the majority of time that a gig driver spends working for the platform, and by excluding the majority of time a driver is on the clock, the company can claim to pay a generous wage while actually paying peanuts. Now, at this phase, you may be thinking that this is only fair, or at least traditional. Livery cab drivers don't get paid unless they have a fare in the cab, right? That's true, but livery cab drivers have lots of ways to influence that number. They can shrewdly choose a good spot to cruise. They can give their cellphone numbers to riders they've established a rapport with in order to win advance bookings. In small towns with just a few drivers – or in cities where drivers are in a co-op – they can spend some of their earnings to advertise the taxi company. Livery drivers can offer discounts to riders going a long way. It's a tough job, but it's one in which workers have some agency. Contrast that with driving for Uber: Uber decides which drivers get to even see a job. Uber decides how to market its services. Uber gets to set fares, on a per-passenger basis, meaning that it might choose to scare some passengers off of a few of their rides with high prices, in a bid to psychologically nudge that passenger into accepting higher fares overall. At the same time, Uber is reliant on a minimum pool of drivers cruising the streets, on the clock but off the payroll. If riders had to wait 45 minutes to get an Uber, they'd make other arrangements. If it happened too often, they'd delete the app. So Uber can't survive without those cruising, unpaid drivers, who provide the capacity that make the company commercially viable. What's more, livery cab drivers aren't the only comparators for gig-work platforms. Many gig workers deliver food, meaning that we should compare them to, say, pizza delivery drivers. These drivers aren't just paid when they have a pizza in the car and they're driving to a customer's home. They're paid from the moment they clock onto their shift to the moment they clock off (plus tips). Now, obviously, this is more expensive for employers, but the Uber Eats arrangement – in which drivers are only paid when they've got a pizza in the car and they're en route to a customer – doesn't eliminate that expense. When a gig delivery company takes away the pay that drivers used to get while waiting for a pizza, they're shifting this expense from employers to workers: https://pluralistic.net/2025/08/20/billionaireism/#surveillance-infantalism The fact that Uber can manipulate the concept of a minimum wage in order to claim to pay $21.12/hour to drivers who are making $2.50 per hour creates all kinds of policy distortions. Take Seattle: in 2024, the city implemented a program called \"PayUp\" that sets a \"minimum wage\" for drivers, but it's not a real minimum wage. It's a minimum payment for every ride or delivery. A new National Bureau of Economic Research paper analyzes the program and concludes that it hasn't increased drivers' pay at all: https://www.nber.org/papers/w34545 To which we might say, \"Duh.\" Cranking up the sum paid for a small fraction of the work you do for a company will have very little impact on the overall wage you receive from the company. However, there is an interesting wrinkle in this paper's conclusions. Drivers aren't earning less under this system, either. So they're getting paid more for every delivery, but they're not adding more deliveries to their day. In other words, they're doing less work and then clocking off: https://marginalrevolution.com/marginalrevolution/2026/02/minimum-wages-for-gig-work-cant-work.html A neoclassical economist (someone who has experienced a specific form of neurological injury that makes you incapable of perceiving or reasoning about power) would say that this means that the drivers only desire to earn the sums they were earning before the \"minimum wage\" and so the program hasn't made a difference to their lives. But anyone else can look at this situation and understand that drivers only did this shitty job out of desperation. They had a sum they needed to get every month in order to pay the rent or the grocery bill. They have lots of needs besides those that they would like to fulfill, but not under the shitty gig-work app conditions. The only reason they tolerate a shitty app as their shitty boss at all is that they are desperate, and that desperation gives gig companies power over their workers. In other words, Seattle's PayUp \"minimum wage\" has shifted some of the expense associated with operating a gig platform from workers back onto their bosses. With fewer drivers available on the app, waiting times for customers will necessarily go up. Some of those customers will take the bus, or get a livery cab, or defrost a pizza, or walk to the corner cafe. For the gig platforms to win those customers back, they will have to reduce waiting times, and the most reliable way to do that is to increase the wages paid to their workers. So PayUp isn't a wash – it has changed the distributional outcome of the gig-work economy in Seattle. Drivers have clawed back a surplus – time they can spend doing more productive or pleasant things than cruising and waiting for a booking – from their bosses, who now must face lower profits, either from a loss of business from impatient customers, or from a higher wage they must pay to get those wait-times down again. But if you want to really move the needle on gig workers' wages, the answer is simple: pay workers for all the hours they put in for their bosses, not just the ones where bosses decide they deserve to get paid for. (Image: Tobias \"ToMar\" Maier, CC BY-SA 3.0; Jon Feinstein, CC BY 2.0; modified) Hey look at this (permalink) Privilege is bad grammar https://tadaima.bearblog.dev/privilege-is-bad-grammar/ Closing the Stablecoin Yield Loophole in the Post-GENIUS Era https://clsbluesky.law.columbia.edu/2026/01/23/closing-the-stablecoin-yield-loophole-in-the-post-genius-era/ The century of the maxxer https://samkriss.substack.com/p/the-century-of-the-maxxer Why the \"AI God\" Narrative is Actually a Corporate Power Grab https://www.thebignewsletter.com/p/monopoly-round-up-stop-telling-me All Your Base, slight remaster https://www.jwz.org/blog/2026/02/all-your-base-slight-remaster/ Object permanence (permalink) #20yrsago HOWTO resist warrantless searches at Best Buy https://www.die.net/musings/bestbuy/ #20yrsago RIAA using kids’ private info to attack their mother https://web.archive.org/web/20060223111437/http://p2pnet.net/story/7942 #20yrsago Sony BMG demotes CEO for deploying DRM https://web.archive.org/web/20060219233817/http://biz.yahoo.com/ap/060210/germany_sony_bmg_ceo.html?.v=7 #20yrsago Sistine Chapel recreated through 10-year cross-stitch project https://web.archive.org/web/20060214195146/http://www.austinstitchers.org/Show06/images/sistine2.jpg #15yrsago Selling cookies like a crack dealer, by dangling a string out your kitchen window https://laughingsquid.com/cookies-sold-by-string-dangling-from-san-francisco-apartment-window/ #15yrsago Midwestern Tahrir: Workers refuse to leave Wisconsin capital over Tea Party labor law https://www.theawl.com/2011/02/wisconsin-demonstrates-against-scott-walkers-war-on-unions/ #10yrsago Back-room revisions to TPP sneakily criminalize fansubbing & other copyright grey zones https://www.eff.org/deeplinks/2016/02/sneaky-change-tpp-drastically-extends-criminal-penalties #10yrsago Russian Central Bank shutting down banks that staged fake cyberattacks to rip off depositors https://web.archive.org/web/20160220100817/http://www.scmagazine.com/russian-bank-licences-revoked-for-using-hackers-to-withdraw-funds/article/474477/ #10yrsago Stop paying your student loans and debt collectors can send US Marshals to arrest you https://web.archive.org/web/20201026202024/https://nymag.com/intelligencer/2016/02/us-marshals-forcibly-collecting-student-debt.html?mid=twitter-share-di #5yrsago Reverse centaurs and the failure of AI https://pluralistic.net/2021/02/17/reverse-centaur/#reverse-centaur #1yrago Business school professors trained an AI to judge workers' personalities based on their faces https://pluralistic.net/2025/02/17/caliper-ai/#racism-machine Upcoming appearances (permalink) Salt Lake City: Enshittification at the Utah Museum of Fine Arts (Tanner Humanities Center), Feb 18 https://tanner.utah.edu/center-events/cory-doctorow/ Montreal (remote): Fedimtl, Feb 24 https://fedimtl.ca/ Oslo (remote): Seminar og lansering av rapport om «enshittification» https://www.forbrukerradet.no/siste-nytt/digital/seminar-og-lansering-av-rapport-om-enshittification/ Victoria: 28th Annual Victoria International Privacy & Security Summit, Mar 3-5 https://www.rebootcommunications.com/event/vipss2026/ Victoria: Enshittification at Russell Books, Mar 4 https://www.eventbrite.ca/e/cory-doctorow-is-coming-to-victoria-tickets-1982091125914 Barcelona: Enshittification with Simona Levi/Xnet (Llibreria Finestres), Mar 20 https://www.llibreriafinestres.com/evento/cory-doctorow/ Berkeley: Bioneers keynote, Mar 27 https://conference.bioneers.org/ Berlin: Re:publica, May 18-20 https://re-publica.com/de/news/rp26-sprecher-cory-doctorow Berlin: Enshittification at Otherland Books, May 19 https://www.otherland-berlin.de/de/event-details/cory-doctorow.html Hay-on-Wye: HowTheLightGetsIn, May 22-25 https://howthelightgetsin.org/festivals/hay/big-ideas-2 Recent appearances (permalink) Panopticon :3 (Trashfuture) https://www.patreon.com/posts/panopticon-3-150395435 America's Enshittification is Canada's Opportunity (Do Not Pass Go) https://www.donotpassgo.ca/p/americas-enshittification-is-canadas Everything Wrong With the Internet and How to Fix It, with Tim Wu (Ezra Klein) https://www.nytimes.com/2026/02/06/opinion/ezra-klein-podcast-doctorow-wu.html How the Internet Got Worse (Masters in Business) https://www.youtube.com/watch?v=auXlkuVhxMo Enshittification (Jon Favreau/Offline): https://crooked.com/podcast/the-enshittification-of-the-internet-with-cory-doctorow/ Latest books (permalink) \"Canny Valley\": A limited edition collection of the collages I create for Pluralistic, self-published, September 2025 https://pluralistic.net/2025/09/04/illustrious/#chairman-bruce \"Enshittification: Why Everything Suddenly Got Worse and What to Do About It,\" Farrar, Straus, Giroux, October 7 2025 https://us.macmillan.com/books/9780374619329/enshittification/ \"Picks and Shovels\": a sequel to \"Red Team Blues,\" about the heroic era of the PC, Tor Books (US), Head of Zeus (UK), February 2025 (https://us.macmillan.com/books/9781250865908/picksandshovels). \"The Bezzle\": a sequel to \"Red Team Blues,\" about prison-tech and other grifts, Tor Books (US), Head of Zeus (UK), February 2024 (thebezzle.org). \"The Lost Cause:\" a solarpunk novel of hope in the climate emergency, Tor Books (US), Head of Zeus (UK), November 2023 (http://lost-cause.org). \"The Internet Con\": A nonfiction book about interoperability and Big Tech (Verso) September 2023 (http://seizethemeansofcomputation.org). Signed copies at Book Soup (https://www.booksoup.com/book/9781804291245). \"Red Team Blues\": \"A grabby, compulsive thriller that will leave you knowing more about how the world works than you did before.\" Tor Books http://redteamblues.com. \"Chokepoint Capitalism: How to Beat Big Tech, Tame Big Content, and Get Artists Paid, with Rebecca Giblin\", on how to unrig the markets for creative labor, Beacon Press/Scribe 2022 https://chokepointcapitalism.com Upcoming books (permalink) \"The Reverse-Centaur's Guide to AI,\" a short book about being a better AI critic, Farrar, Straus and Giroux, June 2026 \"Enshittification, Why Everything Suddenly Got Worse and What to Do About It\" (the graphic novel), Firstsecond, 2026 \"The Post-American Internet,\" a geopolitical sequel of sorts to Enshittification, Farrar, Straus and Giroux, 2027 \"Unauthorized Bread\": a middle-grades graphic novel adapted from my novella about refugees, toasters and DRM, FirstSecond, 2027 \"The Memex Method,\" Farrar, Straus, Giroux, 2027 Colophon (permalink) Today's top sources: Currently writing: \"The Post-American Internet,\" a sequel to \"Enshittification,\" about the better world the rest of us get to have now that Trump has torched America (1148 words today, 30940 total) \"The Reverse Centaur's Guide to AI,\" a short book for Farrar, Straus and Giroux about being an effective AI critic. LEGAL REVIEW AND COPYEDIT COMPLETE. \"The Post-American Internet,\" a short book about internet policy in the age of Trumpism. PLANNING. A Little Brother short story about DIY insulin PLANNING This work – excluding any serialized fiction – is licensed under a Creative Commons Attribution 4.0 license. That means you can use it any way you like, including commercially, provided that you attribute it to me, Cory Doctorow, and include a link to pluralistic.net. https://creativecommons.org/licenses/by/4.0/ Quotations and images are not included in this license; they are included either under a limitation or exception to copyright, or on the basis of a separate license. Please exercise caution. How to get Pluralistic: Blog (no ads, tracking, or data-collection): Pluralistic.net Newsletter (no ads, tracking, or data-collection): https://pluralistic.net/plura-list Mastodon (no ads, tracking, or data-collection): https://mamot.fr/@pluralistic Medium (no ads, paywalled): https://doctorow.medium.com/ Twitter (mass-scale, unrestricted, third-party surveillance and advertising): https://twitter.com/doctorow Tumblr (mass-scale, unrestricted, third-party surveillance and advertising): https://mostlysignssomeportents.tumblr.com/tagged/pluralistic \"When life gives you SARS, you make sarsaparilla\" -Joey \"Accordion Guy\" DeVilla READ CAREFULLY: By reading this, you agree, on behalf of your employer, to release me from all obligations and waivers arising from any and all NON-NEGOTIATED agreements, licenses, terms-of-service, shrinkwrap, clickwrap, browsewrap, confidentiality, non-disclosure, non-compete and acceptable use policies (\"BOGUS AGREEMENTS\") that I have entered into with your employer, its partners, licensors, agents and assigns, in perpetuity, without prejudice to my ongoing rights and privileges. You further represent that you have the authority to release me from any BOGUS AGREEMENTS on behalf of your employer. ISSN: 3066-764X",
      "full_content": null
    }
  ],
  "shkspr.mobi": [
    {
      "title": "Gadget Review: Epomaker Split 70 Mechanical Keyboard ★★★★⯪",
      "url": "https://shkspr.mobi/blog/2026/02/gadget-review-epomaker-split-70-mechanical-keyboard/",
      "source": "shkspr.mobi",
      "published": "2026-02-17T12:34:09+00:00",
      "summary": "The good folks at Epomaker know that I love an ergonomic keyboard, so they've sent me their new \"Split 70\" model to review.  This isn't your traditional ergonomic keyboard. Essentially, this is two separate halves joined by a USB-C cable; so you can position it however you like.    Here's a quick video showing it in action:  https://shkspr.mobi/blog/wp-content/uploads/2026/02/split-new.mp4  It is …",
      "full_content": null
    }
  ],
  "devblogs.microsoft.com/oldnewthing": [
    {
      "title": "Microspeak: Escrow",
      "url": "https://devblogs.microsoft.com/oldnewthing/20260217-00/?p=112067",
      "source": "devblogs.microsoft.com/oldnewthing",
      "published": "2026-02-17T15:00:00+00:00",
      "summary": "Final build, final, final, final 2, ship this one. The post Microspeak: Escrow appeared first on The Old New Thing .",
      "full_content": null
    }
  ],
  "garymarcus.substack.com": [
    {
      "title": "Rumors of AGI’s arrival have been greatly exaggerated",
      "url": "https://garymarcus.substack.com/p/rumors-of-agis-arrival-have-been",
      "source": "garymarcus.substack.com",
      "published": "2026-02-17T16:05:48+00:00",
      "summary": "Statistical approximation ≠ general intelligence",
      "full_content": null
    }
  ],
  "nesbitt.io": [
    {
      "title": "Platform Strings",
      "url": "https://nesbitt.io/2026/02/17/platform-strings.html",
      "source": "nesbitt.io",
      "published": "2026-02-17T10:00:00+00:00",
      "summary": "An M1 Mac is aarch64-apple-darwin, arm64-darwin, darwin/arm64, or macosx_11_0_arm64 depending on which tool you ask.",
      "full_content": null
    }
  ],
  "entropicthoughts.com": [
    {
      "title": "Learning KeyBee",
      "url": "https://entropicthoughts.com/learning-keybee",
      "source": "entropicthoughts.com",
      "published": "2026-02-16T23:00:00+00:00",
      "summary": "",
      "full_content": null
    }
  ],
  "dfarq.homeip.net": [
    {
      "title": "First BBS goes online Feb. 16, 1978",
      "url": "https://dfarq.homeip.net/first-bbs-goes-online-feb-16-1978/?utm_source=rss&utm_medium=rss&utm_campaign=first-bbs-goes-online-feb-16-1978",
      "source": "dfarq.homeip.net",
      "published": "2026-02-17T12:00:27+00:00",
      "summary": "On February 16, 1978, Ward Christensen and Randy Suess launched the first public dialup BBS, or bulletin board system, the predecessor of online discussion forums and web sites like Reddit and Digg. An electronic bulletin board over dialup With no The post First BBS goes online Feb. 16, 1978 appeared first on The Silicon Underground .",
      "full_content": null
    }
  ],
  "berthub.eu": [
    {
      "title": "De digitale coalitieplannen: gaat het ook echt gebeuren?",
      "url": "https://berthub.eu/articles/posts/digitale-coalitieplannen/",
      "source": "berthub.eu",
      "published": "2026-02-17T19:50:00+00:00",
      "summary": "In het eerdere stuk Digitaal zoet en zuur in het coalitieakkoord schreef ik over de bemoedigende en minder bemoedigende stukken van de coalitieplannen.\nEn er staan mooie digitale voornemens in:\nEen revolutie in de ICT in de Rijksoverheid: centrale aansturing, centrale inkoop, verplichte standaarden, geen geld als men zich niet aan die standaarden houdt. Ook pleit men voor een “Nederlandse Digitale Dienst” binnen de overheid met “doorzettingsmacht”, met meer waardering voor ICT-talent Men wil echt weg uit de Amerikaanse cloud, en digitale autonomie moet het uitgangspunt zijn.",
      "full_content": null
    }
  ],
  "hey.paris": [
    {
      "title": "The New Try Yarn Spinner",
      "url": "https://hey.paris/posts/new-try-yarn-spinner/",
      "source": "hey.paris",
      "published": "2026-02-17T00:00:00+00:00",
      "summary": "We recently released a brand new Try Yarn Spinner , which I wrote (more details in the Yarn Spinner January update ), and I wrote a new demo story too! Check it out below: Technical post on the new Try Yarn Spinner coming soon.",
      "full_content": null
    }
  ],
  "troyhunt.com": [
    {
      "title": "Weekly Update 491",
      "url": "https://www.troyhunt.com/weekly-update-491/",
      "source": "troyhunt.com",
      "published": "2026-02-17T05:09:12+00:00",
      "summary": "Well, the ESP32 Bluetooth bridge experiment was a complete failure. Not the radios themselves, they're actually pretty cool, but there's just no way I could get the Yale locks to be reliably operated by them. At a guess, BLE is a bit too passive to detect",
      "full_content": null
    }
  ],
  "martinalderson.com": [
    {
      "title": "Anthropic's 500 vulns are the tip of the iceberg",
      "url": "https://martinalderson.com/posts/anthropic-found-500-zero-days/?utm_source=rss",
      "source": "martinalderson.com",
      "published": "2026-02-17T00:00:00+00:00",
      "summary": "Anthropic's red team found 500+ critical vulnerabilities with Claude. But they focused on maintained software. The scarier problem is the long tail that nobody will ever patch.",
      "full_content": null
    }
  ],
  "experimental-history.com": [
    {
      "title": "I swear the UFO is coming any minute",
      "url": "https://www.experimental-history.com/p/i-swear-the-ufo-is-coming-any-minute",
      "source": "experimental-history.com",
      "published": "2026-02-17T16:15:11+00:00",
      "summary": "Links 'n' updates",
      "full_content": null
    }
  ]
}